# Шаблон поучил по запросу к CATGPT у своего же бота(напиши мне Dockerfile для nodejs )
# Используем официальный образ Node.js
# Если не укажем версию, docker или выберет локальную(если она установлена) или обратится к хабу и возмет последнюю
FROM node:18

# Создаем и переходим в рабочую директорию в контейнере
# в данном случае это директория в которой лежит /app
# Думаю, что в моем случае надо /src/main
WORKDIR /app

# Копируем файлы package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта в контейнер
# первая точка означает, что мы копируем весь проект, а вторая, что мы помещаем копию в корень этой же рабочей дириктории.
COPY . .

# Открываем порт, на котором будет работать бот, не обязательная команда, но рекомендуемая
EXPOSE 3000

# Запускаем приложение
# или dev? или можно просто файл, не обращаясь к package.json , в данном случае main.js
CMD ["npm", "start"]
